Documents/ДополнительныеЗатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ДополнительныеЗатраты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СуммаПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ДополнительныеЗатраты/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ОстаткиНоменклатуры.Записывать=Истина;
	Движения.ОстаткиНоменклатуры.Записать();
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеЗатратыСписокНоменклатуры.Партия КАК Партия,
		|	СУММА(ДополнительныеЗатратыСписокНоменклатуры.Сумма) КАК Сумма
		|ПОМЕСТИТЬ СписокПартий
		|ИЗ
		|	Документ.ДополнительныеЗатраты.СписокНоменклатуры КАК ДополнительныеЗатратыСписокНоменклатуры
		|ГДЕ
		|	ДополнительныеЗатратыСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДополнительныеЗатратыСписокНоменклатуры.Партия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(ПриходнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество,
		|	СписокПартий.Партия КАК Партия,
		|	СписокПартий.Сумма КАК Сумма
		|ИЗ
		|	СписокПартий КАК СписокПартий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.СписокНоменклатуры КАК ПриходнаяНакладнаяСписокНоменклатуры
		|		ПО СписокПартий.Партия = ПриходнаяНакладнаяСписокНоменклатуры.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриходнаяНакладнаяСписокНоменклатуры.Номенклатура,
		|	СписокПартий.Партия,
		|	СписокПартий.Сумма
		|ИТОГИ
		|	СУММА(Количество),
		|	МАКСИМУМ(Сумма)
		|ПО
		|	Партия";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаНом = Новый ТаблицаЗначений;
	ТаблицаНом.Колонки.Добавить("Номенклатура");
	ТаблицаНом.Колонки.Добавить("Партия");

	ВыборкаПартия = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПартия.Следующий() Цикл
		
		СуммаКРапределению 	= ВыборкаПартия.Сумма;
		ОбщееКолво 			= ВыборкаПартия.Количество;
		
		Если ОбщееКолво = 0 Тогда
			Продолжить;
		КонецЕсли; 
	
		Выборка = ВыборкаПартия.Выбрать();
		
		КолвоСтрок 	= Выборка.Количество();
		номерстр 	= 0;
		ОстСуммаСеб = ВыборкаПартия.Сумма;
		
		Пока Выборка.Следующий() Цикл
			номерстр = номерстр + 1;
			Коэфф = Выборка.Количество / ОбщееКолво;
			
			Движение = Движения.ОстаткиНоменклатуры.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Партия = Выборка.Партия;
			
			СуммаСеб = Выборка.Сумма * Коэфф;
			
			Если номерстр = КолвоСтрок Тогда
				Движение.Сумма = ОстСуммаСеб;
			иначе
				Движение.Сумма = СуммаСеб;
			КонецЕсли; 
			
			ОстСуммаСеб = ОстСуммаСеб - СуммаСеб;
			
			НоваяСтрока = ТаблицаНом.Добавить();
			НоваяСтрока.Номенклатура = Выборка.Номенклатура;
			НоваяСтрока.Партия = Выборка.Партия;
		КонецЦикла;
	КонецЦикла;
	

	
	Движения.ОстаткиНоменклатуры.Записывать = Истина;

	Движения.Записать();
	
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	
	//проводки по доведению себестоимтости продаж
	
	ТаблицаНом.Свернуть("Номенклатура, Партия");
	
	Блокировка = Новый БлокировкаДанных;	 	 
	Элемент = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");	 	 
	Элемент.Режим = РежимБлокировкиДанных.Исключительный;	 	 
	Элемент.ИсточникДанных = ТаблицаНом;	 	 
	Элемент.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура"); 	 	 
	Элемент.ИспользоватьИзИсточникаДанных("Партия", "Партия"); 	 	 
	
	Блокировка.Заблокировать();	 	 

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокПартий.Партия КАК Партия
		|ПОМЕСТИТЬ ВТСписокПартий
		|ИЗ
		|	СписокПартий КАК СписокПартий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиНоменклатурыОбороты.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОбороты.Партия КАК Партия,
		|	ОстаткиНоменклатурыОбороты.КоличествоРасход КАК КоличествоРасход,
		|	ОстаткиНоменклатурыОбороты.СуммаРасход КАК СуммаРасход,
		|	ОстаткиНоменклатурыОбороты.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВтТаблицаСписания
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			Партия В
		|				(ВЫБРАТЬ
		|					ВТСписокПартий.Партия КАК Партия
		|				ИЗ
		|					ВТСписокПартий КАК ВТСписокПартий)) КАК ОстаткиНоменклатурыОбороты
		|ГДЕ
		|	ОстаткиНоменклатурыОбороты.КоличествоРасход > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтТаблицаСписания.Номенклатура КАК Номенклатура,
		|	ВтТаблицаСписания.Партия КАК Партия,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ВтТаблицаСписания.КоличествоРасход КАК КоличествоРасход,
		|	ВтТаблицаСписания.СуммаРасход КАК СуммаРасход,
		|	ВтТаблицаСписания.Регистратор КАК Регистратор
		|ИЗ
		|	ВтТаблицаСписания КАК ВтТаблицаСписания
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|				&МоментВремени,
		|				(Номенклатура, Партия) В
		|					(ВЫБРАТЬ
		|						ВтТаблицаСписания.Номенклатура КАК Номенклатура,
		|						ВтТаблицаСписания.Партия КАК Партия
		|					ИЗ
		|						ВтТаблицаСписания КАК ВтТаблицаСписания)) КАК ОстаткиНоменклатурыОстатки
		|		ПО ВтТаблицаСписания.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура
		|			И ВтТаблицаСписания.Партия = ОстаткиНоменклатурыОстатки.Партия
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура
		|ИТОГИ
		|	СУММА(КоличествоОстаток),
		|	СУММА(СуммаОстаток),
		|	СУММА(КоличествоРасход),
		|	СУММА(СуммаРасход)
		|ПО
		|	Номенклатура,
		|	Регистратор
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени(),ВидГраницы.Включая));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНом = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНом.Следующий() Цикл
		
		ВыборкаРег = ВыборкаНом.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаРег.Следующий() Цикл
			
			Выборка = ВыборкаРег.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				СуммаСеб = Выборка.СуммаОстаток * Выборка.КоличествоРасход / Выборка.КоличествоОстаток;
				Разница = СуммаСеб - Выборка.СуммаРасход;
				Если Разница = 0 Тогда
					продолжить;
				КонецЕсли; 
				
				НаборЗаписей = РегистрыНакопления.ОстаткиНоменклатуры.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
				НаборЗаписей.Прочитать();
				
				
				Запись = НаборЗаписей.Добавить();
				Запись.Период 		= Выборка.Регистратор.Дата;
				Запись.Номенклатура = Выборка.Номенклатура;
				Запись.Партия 		= Выборка.Партия;
				Запись.Сумма 		= Разница;
				
				НаборЗаписей.Записать();
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	

	
	

КонецПроцедуры
